LoadTest/SingleProcess/school2_lec_2_students_chat.txt
Started phase 0, duration: 50s @ 01:53:37(+0530) 2021-08-08
Report @ 01:53:47(+0530) 2021-08-08
Elapsed time: 13 seconds
  Scenarios launched:  9
  Scenarios completed: 0
  Requests completed:  44
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 8.3
    median: 0.1
    p95: 1.3
    p99: 8.3
  Codes:
    0: 44
  engine.socketio.emit: 44

Report @ 01:53:57(+0530) 2021-08-08
Elapsed time: 23 seconds
  Scenarios launched:  10
  Scenarios completed: 0
  Requests completed:  55
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 2.1
    median: 0.1
    p95: 0.8
    p99: 2.1
  Codes:
    0: 55
  engine.socketio.emit: 55

Report @ 01:54:07(+0530) 2021-08-08
Elapsed time: 33 seconds
  Scenarios launched:  10
  Scenarios completed: 0
  Requests completed:  63
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 2.8
    median: 0.1
    p95: 0.7
    p99: 2.6
  Codes:
    0: 63
  engine.socketio.emit: 63

Report @ 01:54:17(+0530) 2021-08-08
Elapsed time: 43 seconds
  Scenarios launched:  10
  Scenarios completed: 0
  Requests completed:  62
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 1.7
    median: 0.2
    p95: 0.7
    p99: 1.6
  Codes:
    0: 62
  Errors:
    Error: xhr post error: 1
    Error: xhr poll error: 1
  engine.socketio.emit: 62

Report @ 01:54:27(+0530) 2021-08-08
Elapsed time: 53 seconds
  Scenarios launched:  10
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 0.7
    median: 0.4
    p95: 0.7
    p99: 0.7
  Codes:
    0: 30
  Errors:
    Error: xhr post error: 2
    Error: xhr poll error: 8
  engine.socketio.emit: 30

Report @ 01:54:37(+0530) 2021-08-08
Elapsed time: 1 minute, 3 seconds
  Scenarios launched:  1
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 0.7
    median: 0.4
    p95: 0.7
    p99: 0.7
  Codes:
    0: 30
  Errors:
    Error: xhr poll error: 1
  engine.socketio.emit: 30

Report @ 01:54:47(+0530) 2021-08-08
Elapsed time: 1 minute, 13 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 0.8
    median: 0.4
    p95: 0.6
    p99: 0.8
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:54:57(+0530) 2021-08-08
Elapsed time: 1 minute, 23 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 1
    median: 0.4
    p95: 0.8
    p99: 1
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:55:07(+0530) 2021-08-08
Elapsed time: 1 minute, 33 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 0.8
    median: 0.5
    p95: 0.7
    p99: 0.8
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:55:17(+0530) 2021-08-08
Elapsed time: 1 minute, 43 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 2.7
    median: 0.4
    p95: 0.8
    p99: 2.7
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:55:27(+0530) 2021-08-08
Elapsed time: 1 minute, 53 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 0.8
    median: 0.5
    p95: 0.8
    p99: 0.8
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:55:37(+0530) 2021-08-08
Elapsed time: 2 minutes, 3 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 1.3
    median: 0.4
    p95: 0.9
    p99: 1.3
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:55:47(+0530) 2021-08-08
Elapsed time: 2 minutes, 13 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 2.1
    median: 0.5
    p95: 1.6
    p99: 2.1
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:55:57(+0530) 2021-08-08
Elapsed time: 2 minutes, 23 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 0.7
    median: 0.4
    p95: 0.7
    p99: 0.7
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:56:07(+0530) 2021-08-08
Elapsed time: 2 minutes, 33 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 1.2
    median: 0.4
    p95: 1
    p99: 1.2
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:56:17(+0530) 2021-08-08
Elapsed time: 2 minutes, 43 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 1.1
    median: 0.5
    p95: 1
    p99: 1.1
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:56:27(+0530) 2021-08-08
Elapsed time: 2 minutes, 53 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 1.2
    median: 0.4
    p95: 0.7
    p99: 1.2
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:56:37(+0530) 2021-08-08
Elapsed time: 3 minutes, 3 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 0.8
    median: 0.4
    p95: 0.7
    p99: 0.8
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:56:47(+0530) 2021-08-08
Elapsed time: 3 minutes, 13 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 0.8
    median: 0.4
    p95: 0.7
    p99: 0.8
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:56:57(+0530) 2021-08-08
Elapsed time: 3 minutes, 23 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 1.3
    median: 0.5
    p95: 1.2
    p99: 1.3
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:57:07(+0530) 2021-08-08
Elapsed time: 3 minutes, 33 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 3.4
    median: 0.4
    p95: 1
    p99: 3.4
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:57:17(+0530) 2021-08-08
Elapsed time: 3 minutes, 43 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 3
    median: 0.4
    p95: 0.8
    p99: 3
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:57:27(+0530) 2021-08-08
Elapsed time: 3 minutes, 53 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 1.2
    median: 0.4
    p95: 0.7
    p99: 1.2
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:57:37(+0530) 2021-08-08
Elapsed time: 4 minutes, 3 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 1.1
    median: 0.3
    p95: 0.9
    p99: 1.1
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:57:47(+0530) 2021-08-08
Elapsed time: 4 minutes, 13 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 1
    median: 0.4
    p95: 1
    p99: 1
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:57:57(+0530) 2021-08-08
Elapsed time: 4 minutes, 23 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 3.4
    median: 0.4
    p95: 0.8
    p99: 3.4
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:58:07(+0530) 2021-08-08
Elapsed time: 4 minutes, 33 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 1.3
    median: 0.4
    p95: 0.6
    p99: 1.3
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:58:17(+0530) 2021-08-08
Elapsed time: 4 minutes, 43 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 1
    median: 0.4
    p95: 0.6
    p99: 1
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:58:28(+0530) 2021-08-08
Elapsed time: 4 minutes, 53 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 1.3
    median: 0.4
    p95: 1.1
    p99: 1.3
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:58:38(+0530) 2021-08-08
Elapsed time: 5 minutes, 3 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  30
  Mean response/sec: NaN
  Response time (msec):
    min: 0.1
    max: 2.7
    median: 0.3
    p95: 0.9
    p99: 2.7
  Codes:
    0: 30
  engine.socketio.emit: 30

Report @ 01:58:48(+0530) 2021-08-08
Elapsed time: 5 minutes, 13 seconds
  Scenarios launched:  0
  Scenarios completed: 9
  Requests completed:  22
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 0.6
    median: 0.3
    p95: 0.6
    p99: 0.6
  Codes:
    0: 22
  engine.socketio.emit: 22

Report @ 01:58:58(+0530) 2021-08-08
Elapsed time: 5 minutes, 23 seconds
  Scenarios launched:  0
  Scenarios completed: 10
  Requests completed:  15
  Mean response/sec: NaN
  Response time (msec):
    min: 0.2
    max: 0.7
    median: 0.4
    p95: 0.7
    p99: 0.7
  Codes:
    0: 15
  engine.socketio.emit: 15

Report @ 01:59:08(+0530) 2021-08-08
Elapsed time: 5 minutes, 33 seconds
  Scenarios launched:  0
  Scenarios completed: 10
  Requests completed:  7
  Mean response/sec: NaN
  Response time (msec):
    min: 0.3
    max: 0.7
    median: 0.5
    p95: 0.7
    p99: 0.7
  Codes:
    0: 7
  engine.socketio.emit: 7

Report @ 01:59:15(+0530) 2021-08-08
Elapsed time: 5 minutes, 41 seconds
  Scenarios launched:  0
  Scenarios completed: 8
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

All virtual users finished
Summary report @ 01:59:15(+0530) 2021-08-08
  Scenarios launched:  50
  Scenarios completed: 37
  Requests completed:  1048
  Mean response/sec: NaN
  Response time (msec):
    min: 0
    max: 8.3
    median: 0.4
    p95: 0.8
    p99: 1.6
  Scenario counts:
    Students with lecture doubts: 39 (78%)
    Silent students: 11 (22%)
  Codes:
    0: 1048
  Errors:
    Error: xhr post error: 3
    Error: xhr poll error: 10
  engine.socketio.emit: 1048